function getFirstPrompt(currentWorkspace, manifest, task, systemPrompt) {
  let prompt = `
${systemPrompt}

============================================================
Workspace
============================================================

${currentWorkspace}

============================================================
Workspace Manifest
============================================================

${manifest.join("\n")}

============================================================
用户任务
============================================================

${task}

============================================================
现在开始工作
============================================================

请严格按照 XML Action 协议执行。

如果需要查看项目，先使用 read。

如果任务最终需要回答用户，
完成分析后必须使用：

<answer><![CDATA[
你的最终答案
]]></answer>

最后使用：

<done/>
`;
  return prompt;
}

module.exports = {
  getFirstPrompt,
};
